Repository: ThalesGroup/pkirpmsign
Catalog: po/*/pkirpmsign.po
Languages: fr

source: Cannot get issuer from certificate
fr: Impossible de trouver le délivreur du certificat

source: Cannot get subject from certificate
fr: Impossible de trouver le détenteur du certificat

source: Cannot open file %s
fr: Impossible d'ouvrir le fichier %s

source: Cannot verify signature, [1;31msignature cannot be trusted.[0m
fr: Impossible de vérifier la signature, [1;31maucune confiance ne doit être accordée à la signature.[0m

source: Cert chain length is too big, max chain length = %d
fr: La chaîne de certificat est trop longue, la taille maximum de la chaîne est %d

source: Could not access to keystore data, is the password valid?
fr: Impossible d'accéder aux données du magasin de clés, le mot de passe est-il valide?

source: Could not compile regex
fr: Impossible de compiler l'expression régulière

source: Could not find a certificate chain for signing certificate, [1;31msignature cannot be trusted.[0m
fr: Impossible de contruire une chaîne de certificats à partir du certificat du signataire, [1;31maucune confiance ne doit être accordée à la signature.[0m

source: Could not find xmldsig in input rpm file.
fr: Impossible de trouver une signature xml dans le fichier rpm fourni.

source: Could not generate a signature.
fr: Impossible de générer une signature.

source: Crypto initialization failed.
fr: La librairie de cyptographie n'a pas pu être initialisée.

source: Error deleting file '%s'
fr: Une erreur est survenue durant la suppression du fichier '%s'

source: Error:
fr: Erreur :

source: Failed to create signature context
fr: Impossible de créer le contexte de signature

source: Failed to initialize keys manager.
fr: Impossible d'initialiser le gestionnaire de clés.

source: Failed to load key from "%s"
fr: Impossible de charger la clé dans "%s"

source: Failed to load pem certificate
fr: Impossible de charger le certificat pem

source: Failed to load pem certificate from "%s"
fr: Impossible de charger le certificat pem à partir de "%s"

source: File name changed. When it was signed the file name was %s, now it is %s
fr: Le nom du fichier a changé. Le nom du fichier au moment de sa signature était %s, son nom actuel est %s

source: Hex representation of signature corrupted.
fr: La représentation hexadécimale de la signature est corrompue.

source: Input file "%s" does not seem to be in pem format
fr: Le fichier d'entrée "%s" ne semble pas être au format pem

source: Invalid namespaces list format
fr: Le format de la liste d'espace de noms est incorrect

source: Keys manager already initialized.
fr: Le gestionnaire de clés est déjà initialisé.

source: Keys manager creation failed
fr: Impossible de créer un gestionnaire de clés

source: Keystore file unrecognized, are you sure %s is a valid p12 file?
fr: Le fichier du magasin de clés n'est pas reconnu, %s est-il bien un fichier p12 valide?

source: Loaded xmlsec library version is not compatible.
fr: La version de la librairie xmlsec est incompatible.

source: More than 1 signing certificate found, signature cannot be verified.
fr: Plus d'un certificat de signature trouvé, la signature ne peut pas être vérifiée.

source: No signing certificate found, signature cannot be verified.
fr: Aucun certificat de signature trouvé, la signature ne peut pas être vérifiée.

source: Password is too long, it should not exceed %d characters.
fr: Le mot de passe est trop long, il ne peut excéder %d caractères.

source: Please enter password for keystore (max %d characters)
fr: Veuillez entrer le mot de passe du magasin de clés (max %d caractères)

source: Regex match failed: %s
fr: La correspondance à l'expression régulière n'est pas établie : %s

source: Signature failed
fr: La signature a échoué

source: Signature is [1;31mINVALID[0m
fr: La signature est [1;31mINVALIDE[0m

source: Signature is [1;32mOK[0m
fr: La signature est [1;32mOK[0m

source: Signature successful!
fr: Signature réussie!

source: Signed by :
fr: Signé par :

source: Something went wrong when writing to file : %s
fr: L'écriture du fichier %s a échoué

source: Start node not found in "%s"
fr: Noeud racine non trouvé dans "%s"

source: Start node not found in template
fr: Noeud racine non trouvé dans le modèle

source: Tried to load default keystore '%s' but file was not found. Please create this file or specify the path to a keystore.
fr: Le magasin de clés par défaut (%s) est introuvable. Veuillez créer ce fichier ou fournir le chemin d'un autre magasin de clés.

source: Tried to load input keystore '%s' but file was not found.
fr: Le magasin de clé fourni (%s) est introuvable.

source: Unable to add namespaces to list
fr: Impossible d'ajouter les espaces de noms à la liste

source: Unable to find file "%s"
fr: Impossible de trouver le fichier "%s"

source: Unable to parse file "%s"
fr: Impossible de parser le fichier "%s"

source: Unable to parse template
fr: Impossible de parser le modèle

source: Unable to register NS with prefix="%s" and href="%s"
fr: Impossible d'ajouter l'espace de nom avec le préfixe "%s" et href="%s"

source: Unknown signature verification error
fr: Erreur de vérification de signature inconnue

source: Unrecognized input rpm format.
fr: Format de rpm non reconnu.

source: Unsupported data to print
fr: Données à afficher non supportées

source: Wrong number of arguments. Usage: %s <file-to-verify> <pem-cert-chain-file> ... (There can be as many pem-cert-chain-file as needed, and they can contain from a single certificate only to the full certificate chain) Or : %s <file-to-verify> This option finds the certificate chain in /etc/pki/rpm-certs/ provided that the cert chain (except the signing cert) is present in this directory
fr: Nombre de paramètres invalide. Utilisation : %s <fichier-à-vérifier> <chaîne-de-certificats-pem> ... (Il peut y avoir autant d'élément chaîne-de-certificats-pem que nécessaire, et chacun peut contenir un ou plusieurs certificats) Ou : %s <fichier-à-vérifier> Dans ce second cas la chaîne de certificats est construite à partir des certificats présents dans le répertoire /etc/pki/rpm-certs/, pour ce faire tous les certificats de la chaîne (excepté le certificat de signature) doivent se trouver dans ce répertoire

source: Wrong number of arguments. Usage: %s <file-to-sign> <p12-file> Or (use default /etc/pki/rpm-keys/keystore.p12) : %s <file-to-sign>
fr: Nombre de paramètres invalide. Utilisation : %s <fichier-à-signer> <fichier-p12> Ou (en utilisant le fichier par défaut /etc/pki/rpm-keys/keystore.p12) : %s <fichier-à-signer>

source: xmlSecCryptoAppDefaultKeysMngrAdoptKey failed
fr: xmlSecCryptoAppDefaultKeysMngrAdoptKey a échoué

source: xmlSecCryptoAppKeyLoad failed: filename=%s
fr: xmlSecCryptoAppKeyLoad a échoué : nom de fichier = %s

source: xmlSecKeySetName failed: name=%s
fr: xmlSecKeySetName a échoué : nom de fichier = %s

source: xmlsec initialization failed.
fr: L'initialisation de xmlsec a échoué.

source: xmlsec-crypto initialization failed.
fr: L'initialisation de xmlsec-crypto a échoué.
